       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.
       AUTHOR. PPUIVIF.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.
           DISPLAY "HELLO WORLD!"
           STOP RUN.
