       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO_WITH_VARIABLE.
       AUTHOR. PPUIVIF.
       
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-MESSAGE PIC X(20) VALUE "Hello World !".

       PROCEDURE DIVISION.
           DISPLAY WS-MESSAGE.
           STOP RUN.
